{
    "common": {
        "name": "miio",
        "version": "0.0.4",
        "news": {
            "0.0.4": {
                "en": "Add yunmi water purifier support. Perfect unit test",
                "de": "Fügen Sie Yunmi-Wasserreiniger hinzu. Perfekter Gerätetest",
                "ru": "Добавьте поддержку очистителя воды yunmi. Идеальный юнит тест",
                "pt": "Adicione o suporte do purificador de água yunmi. Teste unitário perfeito",
                "nl": "Voeg yunmi waterzuiveringsinstallatie-ondersteuning toe. Perfecte unit test",
                "fr": "Ajoutez un support pour purificateur d'eau yunmi. Test unitaire parfait",
                "it": "Aggiungi il supporto depuratore d'acqua yunmi. Test dell'unità perfetto",
                "es": "Añadir soporte purificador de agua yunmi. Prueba de unidad perfecta",
                "pl": "Dodaj wsparcie oczyszczania wody yunmi. Doskonały test jednostkowy",
                "zh-cn": "添加yunmi净水器支持。完善单元测试"
            },
            "0.0.3": {
                "en": "Add value mapper function. Add CommandInPara command",
                "de": "Fügen Sie die Value-Mapper-Funktion hinzu. Fügen Sie den Befehl CommandInPara hinzu",
                "ru": "Добавить функцию сопоставления значений. Добавить команду CommandInPara",
                "pt": "Adicione a função de mapeador de valor. Adicionar comando CommandInPara",
                "nl": "Waarde-mapper-functie toevoegen. CommandInPara-opdracht toevoegen",
                "fr": "Ajouter une fonction de mappeur de valeur. Ajouter une commande CommandInPara",
                "it": "Aggiungi la funzione di mappatura dei valori. Aggiungi il comando CommandInPara",
                "es": "Agregar función de mapeador de valor. Agregar Comando CommandInPara",
                "pl": "Funkcja dodawania mapowania wartości. Dodaj polecenie CommandInPara",
                "zh-cn": "添加值映射器功能。添加CommandInPara命令"
            },
            "0.0.2": {
                "en": "Add new device support. Fix some TS lint error",
                "de": "Neue Geräteunterstützung hinzufügen. Beheben Sie einen TS-Fusselfehler",
                "ru": "Добавить поддержку нового устройства. Исправить ошибку TS lint",
                "pt": "Adicionar novo suporte ao dispositivo. Corrigir algum erro de fiapos TS",
                "nl": "Voeg nieuwe apparaatondersteuning toe. Fix een TS lint fout",
                "fr": "Ajouter un nouveau support de périphérique. Correction d'une erreur de peluches TS",
                "it": "Aggiungi nuovo supporto per dispositivo. Correggere alcuni errori di lint TS",
                "es": "Añadir nuevo soporte de dispositivo. Solucionar algunos errores de pelusa TS",
                "pl": "Dodaj nową obsługę urządzenia. Napraw niektóre błędy linków TS",
                "zh-cn": "添加新设备支持。修复一些TS lint错误"
            },
            "0.0.1": {
                "en": "initial release",
                "de": "Erstveröffentlichung",
                "ru": "Начальная версия",
                "pt": "lançamento inicial",
                "nl": "Eerste uitgave",
                "fr": "Première version",
                "it": "Versione iniziale",
                "es": "Versión inicial",
                "pl": "Pierwsze wydanie",
                "zh-cn": "首次提交"
            }
        },
        "title": "Xiaomi miIO protocol device",
        "titleLang": {
            "en": "Xiaomi miIO protocol device",
            "de": "Xiaomi miIO Protokollgerät",
            "ru": "Протокол протокола Xiaomi miIO",
            "pt": "Dispositivo de protocolo miIO Xiaomi",
            "nl": "Xiaomi miIO-protocolapparaat",
            "fr": "Périphérique de protocole Xiaomi miIO",
            "it": "Dispositivo protocollo Xiaomi miIO",
            "es": "Dispositivo de protocolo Xiaomi miIO",
            "pl": "Urządzenie protokołu Xiaomi miIO",
            "zh-cn": "小米miIO协议设备"
        },
        "desc": {
            "en": "This adapter controls devices which followed miIO protocol.",
            "de": "Dieser Adapter steuert Geräte, die dem miIO-Protokoll folgen.",
            "ru": "Этот адаптер управляет устройствами, которые следуют протоколу miIO.",
            "pt": "Este adaptador controla dispositivos que seguiram o protocolo miIO.",
            "nl": "Deze adapter bestuurt apparaten die het miIO-protocol volgden.",
            "fr": "Cet adaptateur contrôle les périphériques qui ont suivi le protocole miIO.",
            "it": "Questo adattatore controlla i dispositivi che seguono il protocollo miIO.",
            "es": "Este adaptador controla dispositivos que siguieron el protocolo miIO.",
            "pl": "Ten adapter steruje urządzeniami, które następują po protokole miIO.",
            "zh-cn": "该适配器控制遵循miIO协议的设备。"
        },
        "authors": [
            "SchumyHao <schumyhaojl@126.com>"
        ],
        "keywords": [
            "ioBroker",
            "template",
            "Smart Home",
            "home automation"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "miio.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/SchumyHao/ioBroker.miio/master/admin/miio.png",
        "readme": "https://github.com/SchumyHao/ioBroker.miio/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "iot-systems",
        "compact": true,
        "materialize": true,
        "materializeTab": true,
        "dependencies": [
            {
                "admin": ">=3.0.0"
            }
        ]
    },
    "native": {
        "autoDiscover": true,
        "autoDiscoverTimeout": "30",
        "devices": []
    },
    "objects": [],
    "instanceObjects": []
}